package com.example.recyclevapp;

public class myData {

    static String[] nameArray = {"שאולי", "אירנה", "ראובן", "אבא", "לות'ר", "הקטור", "קרקו", "אבי", "אמציה", "השכן", "ג'ורג'"};
    static String[] descriptionArray = {
            "הדמות הראשית בחבורה.\n" +
            "מובטל חסר מעש (עובד בזוגיות) חצוף, חסר נימוס וגרוש פעמיים.\n" +
            "בן זוגה של אירנה ואחיו של ראובן, יש לו ילד בשם לות'ר מנישואיו הראשונים, החי בארצות הברית.",

            "בת זוגו הרוסיה של שאולי ואמא מאמצת ללות'ר.\n" +
            "עובדת כמלצרית ב\"מפלט הסטייק\".\n" +
            "עצבנית אך נאמנה לשאולי ואף תמימה מדי לידו.",

            "אחיו הרווק של שאולי שחזר בתשובה.\n" +
            "החל בתור מובטל אך קיבל עבודה כנהג לימוזינה בהמשך.\n" +
            "היה הילד האהוב על אמו המנוחה.",

            "אביהם הזקן של שאולי וראובן שהתאלמן.\n" +
            "בצעירותו עבד כנגן עוד למלך תוניס.\n" +
            "נעזר במקל הליכה ומדבר בג'יבריש המתחזה לניב צפון-אפריקאי ומובן רק לשאולי וראובן.\n" +
            "עצבני מאוד, בייחוד על אשתו המנוחה.\n" +
            "דמותו מבוססת על סבו של כהן.",

            "בנו הממזר של שאולי מנישואיו הראשונים, החי בארצות הברית.\n" +
            "השניים מדברים בסקייפ תוך כדי ששאולי נוהג לגנות אותו במילים גסות.\n" +
            "מבלה הרבה עם חברו סמואל(\"שמואל\").",

            "רופא ומנהל מחלקה יליד ארגנטינה, נשוי לכרמלה.\n" +
            "בעל מבטא ספרדי ומאופיין כשקט, תמים ומנומס.\n" +
            "דמותו מבוססת על ד\"ר מרטין אידלמן, אביו של מריאנו.",

            "החבר השתקן שבחבורה.\n" +
            "בן 70 ויליד לוב.\n" +
            "עובד בספארי ברמת גן כמטפל בחיות.\n" +
            "חובש כובע בוקרים ומדבר בקול נמוך.\n" +
            "שמו הפרטי נחשף רק במערכון בארץ נהדרת.",

            "מובטל מזה שנים, אשר מתנהג בישירות ואף בגסות רוח בניסיונותיו להרוויח כסף.\n" +
            "יש לו כלבה מסוג פקינז בשם ליידי.\n" +
            "אמו הורדמה בידי ג'ורג', עקב טעות הבנה.\n" +
            "בארץ נהדרת נאמר כי פרטוש נשוי לרחל, אך היא לא הופיעה בסדרה.",

            "נהג מונית יליד פולין.\n" +
            "מתואר כחנון החבורה ולעיתים יוצא נגד חבריו.\n" +
            "נשוי לנורית ואב למיכל, איתמר ואמיר.\n" +
            "שם המשפחה שלו נחשף רק במערכון בארץ נהדרת.\n" +
            "במערכון \"פולין\" נחשף דווקא ששם משפחתו הוא פישלברוכנר.",

            "השכן האתאיסט של שאולי, ראובן ואביהם שלו חברה וכלב.\n" +
            "מבקר אצלם לעיתים אך נפגע מיחסם אליו.",

            "הוטרינר (\"וטרינטור\") הראשי בספארי ברמת גן, שמוצאו ערבי.\n" +
            "מרדים חיות בספארי כדי שלא יתפסו מקום במרפאה ואף מוכר אותם כחובות להימורים, מבלי ידיעת העובדים סביבו.\n" +
            "מנצל את תמימותו של קרקו כלפיו."
    };
    static String[] quoteArray = {
            "איציייקקק!!! כמה פעמים אמרתי לך אתה לא זז מהקבלת פנים",

            "שולי 10 שקל? למפגרים!",

            "אי! אתה תשב על הודי",

            "אז'י בם בם",

            "wtf dad?!",

            "עדיף 2 קילו של מזל מאשר 2 קילו חרא, בספרדית זה נשמע יותר טוב",

            "לפחות אתה הייתה יורה באתון, משהו",

            "אני לא אהיה קיים בשישי!",

            "תן לו איזה דאחלה קטנה",

            "בטוח בטוח בטוח",

            "היה לי פול קינג בפלופ אתה מדבר איתי על קוף? את הילד שלי אני שם על דבר כזה"
    };

    static Integer[] drawableArray = {R.drawable.shauli, R.drawable.irena, R.drawable.reuven,
            R.drawable.dad, R.drawable.luther, R.drawable.hektor,
            R.drawable.karako, R.drawable.avi, R.drawable.amatzia ,R.drawable.neighbor, R.drawable.george};

    static Integer[] id_ = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10};

}
